[{"default_branch":"main","description":"Das Plugin erzeugt nach dem Bestellabschluss die PDF Dokumente zur Bestellung automatisch.","html_url":"https://github.com/bauer-group/SWP-CreateDocuments","name":"SWP-CreateDocuments"},{"default_branch":"main","description":"Das Plugin fügt ein definierbares PDF Dokument automatisch im Rahmen der Dokumentenerstellung an das erstellte Dokument an. Im Ergebnis wird ein PDF Dokument erzeugt das aus dem Shopware Dokument und in den Folgeseiten aus dem bereitgestellten Dokument besteht. Unterstüzt werden Rechnung und Lieferschein.","html_url":"https://github.com/bauer-group/SWP-DocumentAppend","name":"SWP-DocumentAppend"},{"default_branch":"main","description":"Das Plugin sendet bereit erstellte PDF Dokumente zur Bestellung automatisch bei einem Statuswechsel in den konfigurierten Status. Das verwendete Mailtemplate entspricht dem bereits vorhandenen Mailtemplate von Shopware für die Statusbenachrichtigung.","html_url":"https://github.com/bauer-group/SWP-DocumentSender","name":"SWP-DocumentSender"},{"default_branch":"main","description":"Das Plugin stellt sicher das alle erstellten Bestellungen die konfigurierten PDF Dokumente automatisch erstellt bekommen. Auch bei manuell in der Datenbank eingetragenen Bestellungen oder Bestellungen die im Backend erstellt wurden.","html_url":"https://github.com/bauer-group/SWP-DocumentsSafety","name":"SWP-DocumentsSafety"},{"default_branch":"main","description":"Das Plugin zeigt die vollständige IP-Adresse zur Bestellung an.","html_url":"https://github.com/bauer-group/SWP-FullIPAddress","name":"SWP-FullIPAddress"},{"default_branch":"main","description":"Das Plugin erweitert Shopware für zwei definierbare Zahlungsmöglichkeiten ein automatisches setzen des Bestellstatus und Zahlungsstatus zu realisieren. Das Plugin ist bereits für Nachname und Rechnung vorkonfiguriert. Der Status zur Bestellung wird damit auch wie bei anderen Zahlungsmöglichkeiten automatisch gesetzt. Damit kann der Auftrag ohne ...","html_url":"https://github.com/bauer-group/SWP-OrderStatusAutomation","name":"SWP-OrderStatusAutomation"},{"default_branch":"main","description":"Das Plugin korrigiert den Bestellzeitpunkt, für Umgebungen bei denen der MySQL Server als Zeitzone UTC verwendet. Als Zeitzone für den Bestellzeitpunkt wird die PHP Einstellung verwendet. Ohne die Korrektur wird der Bestellzeitpunkt falsch angezeigt. Im Backend steht die UTC Zeitangabe, die aber falsch als lokale Zeitangabe ausgewiesen wird. Das...","html_url":"https://github.com/bauer-group/SWP-OrderTimestampCorrection","name":"SWP-OrderTimestampCorrection"},{"default_branch":"main","description":"Das Plugin zeigt den Steuerausweis für jeden Steuersatz getrennt mit den zugehörigen Nettobeträgen an. Damit Entspricht die Rechnung dem § 14 Abs. 4 Nr. 7 UStG in Verbindung mit § 33 UStDV (es ist das nach Steuersätzen und einzelnen Steuerbefreiungen aufgeschlüsselte Netto-Entgelt anzugeben).","html_url":"https://github.com/bauer-group/SWP-TaxIdentification","name":"SWP-TaxIdentification"},{"default_branch":"main","description":"Das Plugin erweitert die API um die Möichkeit PDF Dokumente zur Bestellung abzurufen.","html_url":"https://github.com/bauer-group/SWP-DocumentAPI","name":"SWP-DocumentAPI"},{"default_branch":"main","description":"Das Plugin passt im Rahmen optimalen Verarbeitung von Amazon Marktplatzaufträgen bestimmte Abläufe im Shop entsprechend an.","html_url":"https://github.com/bauer-group/SWP-AmazonToolkit","name":"SWP-AmazonToolkit"},{"default_branch":"main","description":"Das Plugin ermöglich die einfache Einbindung von Bootstrap in ihrem Shoptemplate. Alle Bootstrap Gestaltungselemente sind im Namensraum 'bootstrap-styles' untergebracht.","html_url":"https://github.com/bauer-group/SWP-BootstrapIntegration","name":"SWP-BootstrapIntegration"},{"default_branch":"main","description":"Integration des Consent Managers von Cookie First (cookiefirst.com). Mit diesem Plugin können sie die Lösung von cookiefirst.com schnell und Einfach in ihren Shopware Shop integrieren. Bitte beachten sie das individuelle Anpassungen je Shop erforderlich sind, um die Funktion entsprechend den gesetzlichen Anforderungen, sicherzustellen. Prüfen si","html_url":"https://github.com/bauer-group/SWP-CookieConsent","name":"SWP-CookieConsent"},{"default_branch":"main","description":"Das Plugin setzt die Anpassungen für den COVID 19 Ticketverkauf um.","html_url":"https://github.com/bauer-group/SWP-CovidTickets","name":"SWP-CovidTickets"},{"default_branch":"main","description":"Das Plugin ermöglich pro Kunde einen individuelle Rabatt im Warenkorb. Der individuelle Rabatt wird in einem Attributsfeld beim Kunden hinterlegt.","html_url":"https://github.com/bauer-group/SWP-CustomerDiscount","name":"SWP-CustomerDiscount"},{"default_branch":"main","description":"Das Plugin lässt die Artikelpreise Preis wie konfiguriert schwanken. Die Preisanpassungen erfolgen abhängig von der Steuereinstellung. Die Preisanpassung gilt also immer auf den Verkauspreis (brutto/netto).","html_url":"https://github.com/bauer-group/SWP-CustomPriceFluctuation","name":"SWP-CustomPriceFluctuation"},{"default_branch":"main","description":"Das Plugin ändert einen Artikelpreis, wenn dieser in einem bestimmtem Zeitraum nicht gekauft wurde. Dabei werden verschiedene Regeln angewendet, die entsprechend konfiguriert werden können. Die Preisanpassungen erfolgen abhängig von der Steuereinstellung. Die Preisanpassung gilt also immer auf den Verkauspreis (brutto/netto).","html_url":"https://github.com/bauer-group/SWP-CustomPriceManager","name":"SWP-CustomPriceManager"},{"default_branch":"main","description":"Das Plugin passt im Rahmen der Senkung der MwSt. / USt. automatisch am Stichtag '01.07.2020 00:00' gesenkt (von 19% auf 16% und von 7% auf 5%). Ebenso wird der Steuersatz wieder am Stichtag '01.01.2021 00:00' automatisch erhöht. Das Plugin benötigt zwingend aktivierte und funktionierende Cronjobs im Shop für die ordnungsgemäße Funktion. Das Plug","html_url":"https://github.com/bauer-group/SWP-GermanVATChanger","name":"SWP-GermanVATChanger"},{"default_branch":"main","description":"Das Plugin versendet zeitgesteuert (CronJob) E-Mails, nachdem die Trackingnummer hinterlegt wurde und zusätzlich der Bestellstatus auf 'komplett ausgeliefert' gesetzt wurde.","html_url":"https://github.com/bauer-group/SWP-IndependentShippingNotification","name":"SWP-IndependentShippingNotification"},{"default_branch":"main","description":"Es werden Promotionen im Artikellisting erstellt. Diese können in der Kategoriekonfiguration für jede Produktkategorie definiert werden.","html_url":"https://github.com/bauer-group/SWP-ListingPromotions","name":"SWP-ListingPromotions"},{"default_branch":"main","description":"Das Plugin leitet Emailnachrichten die durch den Shop versendet werden um, auf eine andere Adresse. Sofern in der Nachricht das Schlüsselwort '[BGMAILBLOCKER]' gefunden wird. Das kann über die Mailtemplates und deren Regelwerke nach Bedarf eingefügt werden. Das Schlüsselwort darf dabei unsichtbar einbeunden werden (z. B. als HTML Kommentar).","html_url":"https://github.com/bauer-group/SWP-MailMessageBlocker","name":"SWP-MailMessageBlocker"},{"default_branch":"main","description":"Das Plugin stellt die hochgeladenen Bilder automatisch frei. Dazu wird der Dienst https://www.remove.bg/ verwendet. Sie benötigen hierfür einen entsprechenden Account.","html_url":"https://github.com/bauer-group/SWP-RemoveBackground","name":"SWP-RemoveBackground"},{"default_branch":"main","description":"Das Plugin schafft die Möglichkeit pro Artikel eine Reservierte Menge zu bestimmen, die von der definierten Kundengruppe nicht erworben werden kann.","html_url":"https://github.com/bauer-group/SWP-SalesVolumeLimiter","name":"SWP-SalesVolumeLimiter"},{"default_branch":"main","description":"Das Plugin exportiert Lagerhüter, wenn diese in einem bestimmtem Zeitraum nicht gekauft wurden.","html_url":"https://github.com/bauer-group/SWP-BauergroupSlowArticleExport","name":"SWP-BauergroupSlowArticleExport"},{"default_branch":"main","description":"Das Plugin schickt eine Bewertungsaufforderung per SMS an die Kunden.","html_url":"https://github.com/bauer-group/SWP-SMSNotifier","name":"SWP-SMSNotifier"},{"default_branch":"main","description":"Special Sale AddOn's","html_url":"https://github.com/bauer-group/SWP-SpecialSaleExtension","name":"SWP-SpecialSaleExtension"},{"default_branch":"main","description":"Das Plugin rechnet die übertragenenen Mengen über die REST API in VE, anhand der Angaben in der Grundpreisberechnung um.","html_url":"https://github.com/bauer-group/SWP-StockBalanceByPackaging","name":"SWP-StockBalanceByPackaging"},{"default_branch":"main","description":"Die Kunden werden nach Ablauf von einer definierten Zahl an Tagen, nach der Bestellung über die Option einer Garantieerweiterung informiert.","html_url":"https://github.com/bauer-group/SWP-WarrantyReminder","name":"SWP-WarrantyReminder"},{"default_branch":"main","description":"Das Plugin ermöglich die einfache Einbindung des Zammad Chatwidgets in ihrem Shop.","html_url":"https://github.com/bauer-group/SWP-ZammadIntegration","name":"SWP-ZammadIntegration"},{"default_branch":"main","description":"Das Plugin zeigt im Storefront das Artikelgewicht, auf der Detailseite, an.","html_url":"https://github.com/bauer-group/SWP-ArticleWeight","name":"SWP-ArticleWeight"},{"default_branch":"main","description":"Das Plugin erweitert den seitlichen Warenkorb (Ajax Warenkorb) um einen Werbebanner mit Artikelverknüpfung. Der Artikel kann direkt innerhalb des Warenkorbs hinzugefügt werden. Die Bestellbestätigungsseite wird um einen Aktionsbanner erweitert, der ebenfalls verlinkt wird mit einer frei definierbaren Aktionsseite.","html_url":"https://github.com/bauer-group/SWP-CheckoutPromotion","name":"SWP-CheckoutPromotion"},{"default_branch":"main","description":"Das Plugin wendet die von Shopware empfohlene Problemlsung zum Problem mit dem Warenkorb fr das Apple iOS 9.3.3 an. Mit der aktuellen iOS-Version 9.3.3 gibt es Probleme einen Artikel in den Warenkorb zu legen. Ursache dafr ist, dass der User-Agent des Apple-Gertes von Shopware als Bot erkannt wird. Durch diesen Umstand funktionieren einige Funkt...","html_url":"https://github.com/bauer-group/SWP-AppleIOS933Hotfix","name":"SWP-AppleIOS933Hotfix"},{"default_branch":"main","description":"Das Plugin erstellt und versendet die Rechnung und den Lieferschein zu einer Bestellung automatisch nach Bestellabschluss.Vorteile:\u0026nbsp;- Konfigurierbar, nach individuellen Vorgaben.\u0026nbsp;- Belegerstellung erfolgt leistungsoptimiert durch einen eigenen Hintergrundprozess, unabhängig vom Checkout.\u0026nbsp;- getested für den Einsatz in hochfrequenti...","html_url":"https://github.com/bauer-group/SWP-AutomaticDocuments","name":"SWP-AutomaticDocuments"},{"default_branch":"main","description":"Das Plugin fügt im Checkout ein Eingabefeld zur Erfassung einer Kostenstelle hinzu. Die erfasste Kostenstelle wird im Freitextfeld 6 der Bestellung abgelegt. Es handelt sich dabei um ein Pflichtfeld.","html_url":"https://github.com/bauer-group/SWP-CheckoutCostCenter","name":"SWP-CheckoutCostCenter"},{"default_branch":"main","description":"Das Plugin fügt im Template Variablen zur Benutzeridentifizierung hinzu. Diese können im Template zur inhaltlichen Anpassung verwendet werden.","html_url":"https://github.com/bauer-group/SWP-CustomerDataInTemplate","name":"SWP-CustomerDataInTemplate"},{"default_branch":"main","description":"Das Plugin fügt in der Einkaufswelt die Möglichkeit der Einbettung von vimeo.com Videos hinzu.","html_url":"https://github.com/bauer-group/SWP-ShoppingWorldVimeo","name":"SWP-ShoppingWorldVimeo"},{"default_branch":"main","description":"Das Plugin fügt in der Artikeldetailansicht einen Tweet Button für Twitter und einen Google +1 Button ein. Die Buttons werden mit einer horizontale Zählung dargestellt.","html_url":"https://github.com/bauer-group/SWP-SocialRecommend","name":"SWP-SocialRecommend"},{"default_branch":"main","description":"Das Plugin fügt in der Artikeldetailansicht einen Tweet Button für Twitter ein. Der Button wird mit einer horizontale Zählung dargestellt.","html_url":"https://github.com/bauer-group/SWP-TwitterTweet","name":"SWP-TwitterTweet"}]
